{
  "basics": {
    "name": "Kyle Milner",
    "label": "Software Engineer - Backend",
    "picture": "",
    "email": "kylemilner@me.com",
    "phone": "+447757801797",
    "website": "",
    "summary": "I am a passionate, highly motivated Software Engineer who likes to write self-documenting clean code. A self-starter who loves to learn, I thrive working in highly skilled close knit teams working to deliver user experience focussed quality software.\nI have a wide range of skills with specific focus to-date around the Java ecosystem and backend web development and am currently self teaching frontend technologies to further broaden my skills.\nI'll never stop asking why things are done and how they can be made better. I am looking for a team who share my enthusiasm, who aren't afraid to move fast and break things and, most importantly, enjoy what they do.",
    "location": {
      "address": "",
      "postalCode": "",
      "city": "",
      "countryCode": "",
      "region": ""
    },
    "profiles": [
      {
        "network": "GitHub",
        "username": "kyrobot",
        "url": "https://github.com/kyRobot"
      },
      {
        "network": "LinkedIn",
        "username": "kylemilner",
        "url": "https://linkedin.com/in/kylemilner"
      }
    ]
  },
  "work": [
    {
      "company": "IDP",
      "position": "Senior Software Engineer, Contract",
      "startDate": "2018-03-01",
      "endDate": "2019-05-21",
      "summary": "IDP required a software integration between their internal CRM products and an external survey platform to enable & drive a real-time Net Promoter Score marketing project. The solution was an event driven, cloud based collection of Java 8 microservices deployed to Amazon Web Services leveraging AWS Lambda, SQS, SNS & API Gateway Services to integrate multiple products via HTTP APIs.\n Reporting directly to the Solution Architect I was singularly responsible for the design, implementation, testing & deployment of several AWS Lambda functions and supporting cloud messaging services. I was also the primary technical liaison between internal and external stakeholders with differing levels of technical understanding and familiarity with the project which required strong communication skills to translate business requirements to viable technical solutions.\n The software was launched into production ahead of schedule and was shown to handle thousands of requests per day without issue.",
      "highlights": [
        "Integrated four separate production business software products via AWS Cloud",
        "Launched simultaneously across 10 countries",
        "Produced a sample application using Lambda Functions which will now be used as a bootstrap by IDP Developers"
      ]
    },
    {
      "company": "Sabbatical",
      "position": "Travelling throughout Asia, New Zealand & Australia",
      "startDate": "2018-05-01",
      "endDate": "2019-01-01",
      "summary": " "
    },
    {
      "company": "World Programming Limited, UK",
      "position": "Senior Software Engineer - WPS Hub (Backend)",
      "startDate": "2016-11-06",
      "endDate": "2018-04-01",
      "summary": "WPS Hub is a web app for management and deployment of WPS Analytics systems across a company network with centralised user management. It provides a repository of multi-language programs for real-time and on demand execution via web APIs. Reporting directly to the Director of Technology I was responsible for the design, implementation and testing of services and RESTful APIs across multiple web apps. Primarily working in Java 8 to a service oriented architecture and with Relational SQL targeting data in graph layout I produced domain optimised data processing pipelines, developer friendly customer facing APIs and scalable, performant production code. Working closely with the frontend team I helped define the design language and UX used throughout the apps and provided occasional development help. As an experienced agile practitioner I worked with stakeholders & project managers to gather and scope requirements into manageable, achievable work items. ",
      "highlights": [
        "Led backend development through the entire software lifecycle from initial concept research & prototyping to multi-customer MVP beta and ahead of schedule production release in 12 months",
        "Produced a bespoke Java annotation powered web framework to enable rapid microservice creation with minimal configuration",
        "Introduced use of Docker in build pipelines which was later used company wide",
        "Piloted adoption of Kanban style working as first agile team in the company",
        "Made steps to becoming Full Stack with commits to production on Vue.js powered frontend & dev-ops contributions "
      ]
    },
    {
      "company": "IBM i2",
      "position": "Staff Software Engineer, i2 Analyze (Backend)",
      "startDate": "2014-11-06",
      "endDate": "2016-11-06",
      "summary": "i2 Analyze is an Intelligence Analysis, Discovery & Visualisation J2EE powered web application. Main responsibilities included design and implementation of data discovery and retrieval features at both the Application and Data layers - primarily developing in Java 8 & SQL. Working in a Kanban Agile team with 2 week sprint cadence I was responsible for building client-facing RESTful APIs for search & discovery services against a Big Data repository and the Data Access Layer interfaces required to support them. Other responsibilities included mentoring junior developers, collaborating closely with cross-site front end development teams and acting as technical contact for non-technical team members.",
      "highlights": [
        "Designed and Implemented an asynchronous REST API for Search",
        "Transitioned application services to using a new underlying datasource with zero downtime or test regressions",
        "Lead a full optimisation focused rewrite of Data Retrieval Service (DAO & SQL layers) to unblock a product release - measurable 10x performance after rework",
        "Introduced templated generation of Database DDL for deployment pipeline",
        "Independently produced a proof of concept for auto generation of external datasource plugins which was productised and shipped",
        "Promoted in year one"
      ]
    },
    {
      "company": "IBM CICS",
      "position": "Software Engineer, CICS Explorer",
      "startDate": "2012-10-06",
      "endDate": "2014-11-06",
      "summary": "CICS Explorer is a desktop Eclipse-based management console for the Mainframe application server CICS. Developer responsibilities included supporting released product versions, new feature design and implementation. Developing in Java 7 in a Scrum Agile team I was primarily focused on adding improvements to existing features and filling capability gaps to a similar legacy web console. Development required UI design & working with mainframe XML based web services. Also became owner of the SDK plugin for deploying web applications to CICS.",
      "highlights": [
        "Presented at UK customer & partner conference",
        "Early promotion from Graduate Scheme (2013)",
        "Owned SDK plugin for IBM Liberty on CICS",
        "Introduced new feature-rich Manifest Editor which was later adopted as the default editor by the wider IBM zOS-Eclipse tools ecosystem"
      ]
    }
  ],
  "volunteer": [],
  "education": [
    {
      "institution": "University Of Sheffield, UK",
      "area": "Artificial Intelligence & Computer Science ",
      "studyType": "BSc(Hons) First Class",
      "startDate": "2009-10-01",
      "endDate": "2012-07-01",
      "gpa": "",
      "courses": []
    }
  ],
  "awards": [],
  "publications": [
    {
      "name": "Automatic Call Handling during Active Conversation",
      "publisher": "IBM, UK Patent Office",
      "releaseDate": "2015-02-01",
      "website": "",
      "summary": "Patent Pending on a method for automatic routing of mobile phone calls when the device is aware that the intended recipient is not able, or will not want, to be disturbed."
    }
  ],
  "skills": [
    {
      "name": "Technical",
      "level": "",
      "keywords": [
        "Languages - Java 8+, JavaScript, React, HTML/CSS",
        "Cloud - AWS",
        "Microservices - API Gateway, Lambda",
        "Distributed Messaging - SQS, SNS",
        "SQL & noSQL",
        "Front & Backend API Design",
        "Testing - TDD/BDD",
        "Unit testing",
        "Software Design Patterns",
        "CI/CD - Jenkins, Gradle, Maven, Docker, Terraform",
        "Source Control - Git, GitHub, BitBucket"
      ]
    },
    {
      "name": "Non-Technical",
      "level": "",
      "keywords": [
        "Detail Oriented",
        "Mentoring",
        "Agile Methodologies - Scrum & Kanban",
        "JIRA",
        "Pair Programming",
        "Technical Communication",
        "Code review",
        "Problem Solving",
        "Presenting to Customers"
      ]
    }
  ],
  "languages": [],
  "interests": [
    {
      "name": "",
      "keywords": [
        "Skiing",
        "Foreign Language Cinema",
        "Coffee",
        "Cooking",
        "Technology",
        "Travel"
      ]
    }
  ],
  "references": []
}
