{
  "basics": {
    "name": "Kyle Milner",
    "label": "Software Engineer - Backend",
    "picture": "",
    "email": "kylemilner@me.com",
    "phone": "07757801797",
    "website": "",
    "summary": "Kyle is a passionate, highly motivated Software Engineer who likes to write self-documenting, clean code. A self starter who loves to learn Kyle has a broad range of skills with specific focus around the Java ecosystem. Kyle never stops asking why things are done and how they can be made better. Kyle is looking for a team who share his enthusiasm for quality, who aren't afraid to move fast and break things and, most importantly, enjoy what they do.",
    "location": {
      "address": "",
      "postalCode": "",
      "city": "",
      "countryCode": "",
      "region": ""
    },
    "profiles": [
      {
        "network": "GitHub",
        "username": "kyrobot",
        "url": "https://github.com/kyRobot"
      },
      {
        "network": "LinkedIn",
        "username": "kylemilner",
        "url": "https://linkedin.com/in/kylemilner"
      }
    ]
  },
  "work": [
    {
      "company": "IBM i2",
      "position": "Analysis Web Client, Backend Software Engineer",
      "startDate": "2014-11-06",
      "endDate": "2016-04-06",
      "summary": "i2 AWC is an Intelligence Analysis, Discovery & Visualisation J2EE powered web application. Main responsibilities included design and implementation of data discovery and retreival features at both the Application and Persistance layers - primarily developing in Java 8 & SQL. Working to Kanban Agile with 2 week sprints I was responsible for development of client-facing REST APIs (collaborating closely with cross-site front end development teams) for Search & Graph Connectedness discovery and architecting the Data Access Layer interfaces to our Big Data repository built on IBM DB2. Other responsibilities included mentoring junior developers and acting as technical contact for non-technical team members.",
      "highlights": [
        "Designed and Implemented asyncronous REST API for Search",
        "Transitioned application services to using a new underlying datasource with zero downtime or test regressions",
        "Promoted in year one",
        "Lead a full optimization-focused rewrite of Data Retreival Service (DAO & SQL layers) to unblock a product release - measurable 10x performance after rework",
        "Introduced templated generation of Database DDL for deployment pipeline",
        "Self started proof of concept for auto generation of external source querying pluggins was productised and shipped"
      ]
    },
    {
      "company": "IBM CICS",
      "position": "Developer, CICS Explorer",
      "startDate": "2013-10-06",
      "endDate": "2014-11-06",
      "summary": "CICS Explorer is a desktop Eclipse-based management console for the Mainframe application server CICS. Developer responsibilities included supporting released product versions, new feature design and implementation. Working in Java 7 to Scrum Agile in 4 week sprints I was focused primarily on improvements to existing features and filling capability gaps to the sunset legacy web console. Development required UI design & working with mainframe xml based web services. Also became owner of the SDK plugin for deploying web applications to CICS.",
      "highlights": [
        "Presented at UK customer & partner conference",
        "Early promotion from Graduate Scheme",
        "Owned SDK plugin for IBM Liberty on CICS",
        "Introduced new feature-rich Manifest Editor which was later adopted as the default editor by the wider IBM zOS-Eclipse tools ecosystem."
      ]
    },
    {
      "company": "IBM CICS",
      "position": "Graduate Software Engineer, CICS Explorer",
      "startDate": "2012-09-06",
      "endDate": "2013-10-06",
      "summary": "Responsibilities included maintenence of existing FV test suites & creation of automated regression tests for new product features working in line with development team. Primarily working in Java with Junit and IBM regression test tooling.",
      "highlights": [
        "Owner of various product area test suites as a graduate",
        "Provided defect fixes to development team in every release, as a tester",
        "Wrote an extensible test result reporting web app used across CICS department",
        "Produced test team onboarding education used by CICS teams worldwide"
      ]
    }
  ],
  "volunteer": [],
  "education": [
    {
      "institution": "University Of Sheffied",
      "area": "Artificial Intelligence & Computer Science ",
      "studyType": "BSc(Hons) First Class",
      "startDate": "2009-10-01",
      "endDate": "2012-07-01",
      "gpa": "",
      "courses": []
    }
  ],
  "awards": [],
  "publications": [
    {
      "name": "Automatic Call Handling during Active Conversation",
      "publisher": "IBM, UK Patent Office",
      "releaseDate": "2015-02-01",
      "website": "http://en.wikipedia.org/wiki/Silicon_Valley_(TV_series)",
      "summary": "Patent Pending on a method for automatic routing of mobile phone calls when the device is aware that the intended recipient is not able, or will not want, to be disturbed."
    }
  ],
  "skills": [
    {
      "name": "Technical",
      "level": "",
      "keywords": [
        "Java/J2EE",
        "SQL (DB2)",
        "Front & Backend API Design",
        "TDD/BDD",
        "Software Design Patterns",
        "CI - Jenkins, Gradle",
        "Source Control - Git, Rational Team Concert",
        "HTML/CSS/JS (comfortable)",
        "Swift (learning)",
        "Spring/Spring Boot (learning)"
      ]
    },
    {
      "name": "Non-Technical",
      "level": "",
      "keywords": [
        "Problem Solving",
        "Agile Methodologies - Scrum & Kanban",
        "Pair Programming",
        "Technical Communication",
        "Code review",
        "Problem Solving",
        "Presenting"
      ]
    }
  ],
  "languages": [],
  "interests": [
    {
      "name": "",
      "keywords": [
        "Skiing",
        "Foreign Language Cinema",
        "Coffee",
        "Cooking",
        "Technology"
      ]
    }
  ],
  "references": []
}